Revit 2024 API
RebarUpdateCurvesData.IsStartConstraintChanged Property
 Indicates if the start handle constraint has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsStartConstraintChanged { get; }
Visual Basic
Public ReadOnly Property IsStartConstraintChanged As Boolean
	Get
Visual C++
public:
property bool IsStartConstraintChanged {
	bool get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace